// 1. Логічні оператори  порівняння та alert:
// Створіть змінні number1 та number2 і використайте оператори порівняння, щоб визначити, чи вони рівні.
// Виведіть результат за допомогою alert, щоб повідомити користувача про те, чи рівні числа.

let number1 = 10;
let number2 = 4;

let result = number1 == number2;

alert(result);

// 2. Використовуючи prompt, запросіть у користувача введення числа.
// Перевірте, чи введене число парне чи непарне.
// Виведіть результат з використанням console.log.

let typeNumber = Number(prompt("Print number", "0"));

let userResult = typeNumber % 2;

console.log(userResult === 0);

// 3. Логічні порівняння та введення-виведення:
// Використовуючи prompt, запитайте у користувача його вік.
// Перевірте, чи вік менше 18 років.
// Виведіть відповідне повідомлення про те, чи може користувач використовувати певний ресурс.

let userAge = Number(prompt("Your age?"));
let checkAge = userAge < 18;

alert(checkAge == true);

// 4. Розрахунок вартості товару та console.log:
// Створіть змінну ціна та кількість товару і присвойте їм значення використовуючи prompt .
// Використовуйте математичні операції для обчислення вартості товару (ціна * кількість).
// Виведіть результат за допомогою console.log.

let Price = 10;
let Value = 3;

console.log(`Total value is ${Price * Value}`);

// 5. Розрахунок знижки на товар та alert:
// Використовуючи prompt, запросіть в користувача вартість товару.
// Розрахуйте знижку на товар у розмірі 50% від введеної вартості.
// Виведіть результат знижки за допомогою alert.

let itemPrice = Number(prompt("Введіть ціну товару"));

let discount = itemPrice / 2;

alert("Ви отримуєте знижку " + Number(discount) + " грн");
